import whisper

model = whisper.load_model("small")


def transcribe(path):
    result = model.transcribe(path)

    return result['text']
    
def temporary():
    return '''
    Благослови́, душе́ моя́, Го́спода. / Благослове́н еси́, Го́споди. / Благослови́, душе́ моя́, Го́спода, / и вся вну́тренняя моя́ И́мя святое́ Его́.
    Благослови́, душе́ моя́, Го́спода, / и не забыва́й всех воздая́ний Его́.
    Очища́ющаго вся беззако́ния твоя́, / исцеля́ющаго вся неду́ги твоя́.
    Избавля́ющаго от истле́ния живо́т твой, / венча́ющаго тя ми́лостию и щедро́тами.
    Исполня́ющаго во благи́х жела́ние твое́: / обнови́тся, я́ко о́рля, ю́ность твоя́.
    '''